export const UNIVERSITIES = [
  "الجامعة الإسلامية بغزة",
  "جامعة الأزهر - غزة",
  "جامعة الأقصى",
  "جامعة فلسطين",
  "جامعة القدس المفتوحة",
  "الكلية الجامعية للعلوم التطبيقية",
  "أخرى",
];

export const ACADEMIC_MAJORS = [
  "هندسة أنظمةالحاسوب",
  "علوم الحاسوب",
  "نظم المعلومات ",
  "هندسة البرمجيات",
  "هندسة حاسوب واتصالات",
  "إدارة الأعمال",
  "المحاسبة والتمويل",
  "الهندسة الكهربائية",
  "أخرى",
];
export const SPECIFIC_MAJOR = [
  "تطوير الويب",
  "تطوير تطبيقات الجوال",
  "الذكاء الاصطناعي وعلوم البيانات",
  "أمن المعلومات",
  "الشبكات",
  "الأمن السيبراني",
  "أخرى",

];

export const getGraduationYears = () => {
  const currentYear = new Date().getFullYear();
  const years = [];
  for (let y = 2022; y <= currentYear + 6; y++) {
    years.push(y);
  }
  return years;
};